数组定义  数组输出   数组输出其中的值

foreach($arr as $key =>$value){

} 

数组函数  测试 --> 理解 --->  记忆





<!--shuffle()：打乱数组，将会删除原有的键名-->
<!--array_sum()：计算数组中所有元素的和-->
<!--array_push()：将一个或多个单元压入数组的末尾-->
<!--array_pop()：将数组的最后一个元素弹出-->
<!--array_shift()：将数组开头的元素移除-->
<!--array_unshift()：往数组头部添加一个元素 -->
<!--array_rand()：从数组中随机取出一个或多个键名 -->

<!--sort()：对数组的值进行升序排列，不保留原有键名-->
<!--rsort()：对数组的值进行降序排列，不保留原有键名-->
<!--asort()：根据关联数组的值，对数组进行升序排列并保持索引关系-->
<!--ksort()：根据关联数组的键，对数组进行升序排列，保持键值的关系-->
<!--arsort()：根据关联数组的值，对数组进行降序排列并保持索引关系-->
<!--krsort()：根据关联数组的键，对数组进行降序排列，保持键值的关系-->

<!--array_merge()：合并一个或者多个数组-->
<!--array_chunk():将一个数组分割成多个-->
<!--array_combine()：创建一个数组，用一个数组的值作为其键名，另一个数组的值作为其值-->
<!--in_array()：检查数组中是否存在某个值-->
<!--array_key_exists()：检查给定的键名或索引是否存在于数组中-->
<!--array_keys():返回数组中部分的或所有的键名-->
<!--array_values():返回数组中所有的值-->

reset()：将数组的内部指针指向第一个单元
each()：返回数组中当前的键／值对并将数组指针向前移动一步
list()：把数组中的值赋给一些变量

/*
<!--count()统计数组的元素个数-->

<!--array_unique()：用于移除数组中的重复元素-->

<!--array_search()：搜索数组中元素，返回该元素对应的键名,若不存在搜索值，返回false-->



<!--array_merge()：合并一个或者多个数组-->

<!--array_chunk():将一个数组分割成多个-->

<!--array_combine()：创建一个数组，用一个数组的值作为其键名，另一个数组的值作为其值-->

<!--in_array()：检查数组中是否存在某个值-->

<!--array_key_exists()：检查给定的键名或索引是否存在于数组中-->

<!--array_keys():返回数组中部分的或所有的键名-->

<!--array_values():返回数组中所有的值-->



*/
























