<?php

header("content-type:text/html;charset=utf-8");

//  for(初始值;判断;初始值变化){
//		循环体;
//  }
//
//
//  初始值;
//  for(;判断;初始值变化){
//		循环体;
//  }
//
//
//  for(初始值;判断;){
//		循环体;
//		初始值变化;
//  }
//
//	初始值
//  for(;判断;){
//		循环体;
//		初始值变化;
//  }
//
//
//初始值
//  for(;;){
//		判断;
//		循环体;
//		初始值变化;
//  }



$i=1;
	for(;;){
		if($i<7){
			echo $i.'<br>';
		}else{
			break;
		}
		$i++;
	}





$i=1;
	for(;$i<10;){
		echo $i.'<br>';
		$i++;
	}




$i=1;
	for(;$i<10;$i++){
		echo $i.'<br>';
	}



	for($i=1;$i<10;$i++){
		echo $i.'<br>';
	}












?>















